heatSolverPy_OpenFOAM/fluid/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;

}

mixture
{
    specie
    {
        molWeight       28.97;
    }
    thermodynamics
    {
        Cp              1000;
        Hf              0;
    }
    transport
    {           
        mu              7e-04;//0.001;

        
        Pr              0.7;


    }
}
// Rho is about 1 and kappa is 0.2407
// ************************************************************************* //
